#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int main()
//{
//	int a = 16;
//	int c = -1;//负数存的是补码
//	int e = 5;
//	//>>是右移操作符
//	//移动的是二进制位
//	//16-->0000000000000000000000000000000000010000 正数原，反，补全部一样
//	//-1-->1000000000000000000000000000000000000001--源码
//	//     1111111111111111111111111111111111111110--反码 符号位不变，其他位按位取反，末尾减一
//	//     1111111111111111111111111111111111111111--补码 反码加一 
//	int b = a >> 1;	
//	int s = c >> 1;
//	int v = e << 1;
//	printf("s=%d\n", s);
//	printf("b=%d\n", b);
//	printf("v=%d\n", v);
//	return 0;
//}
//右移操作符
//1.算术右移
//  右边丢弃，左边原符号位
//2.逻辑右移
//  右边丢弃，左边补0
//左移操作符
// 1.左边丢弃，右边补0 相当于*2


//位操作符
//int main()
//{
	//&-按2进制位与 
	/*int a = 5;
	int b = 3;
	int c = a & b;*/
	//a=5-->00000000000000000000000000000101
	//b=3-->00000000000000000000000000000011
	//c=c-->00000000000000000000000000000001=1 相同为1   相反为0
	/*printf("%d\n", c);*/
	
	//|-按2进制位或
	//int a = 5;
	//int b = 3;
	//int c = a | b;
	////a=5-->00000000000000000000000000000101
	////b=3-->00000000000000000000000000000011
	////c=c-->00000000000000000000000000000111=7  0与0为0 // 0与1为1 // 1与1为1	
	//printf("%d\n", c);
	
	//^-按位异或
	//int a = 5;
	//int b = 3;
	//int c = a ^ b;
	////a=5-->00000000000000000000000000000101
	////b=3-->00000000000000000000000000000011
	////c=c-->00000000000000000000000000000110=6 相同为0，相异为1
	//printf("%d\n",c);
	//return 0;
//}

//不创建临时变量交换两个数 a=3 b=5
int main()
{
	int a = 3;
	int b = 5;
	a = a ^ b;
	//a 011
	//b 101
	//^ 110=a
	b = a ^ b;
	//a 110
	//b 101
	//^ 011=b
	a = a ^ b;
	//a 110
	//b 011
	//^ 101=a
	// a 101
	// b 011
	printf("a=%d b=%d \n", a, b);
	return 0;
}